atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
/*
 * This file is part of AtomVM.
 *
 * Copyright 2018 Davide Bettio <davide@uninstall.it>
 * Copyright 2020-2023 Fred Dushin <fred@dushin.net>
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * SPDX-License-Identifier: Apache-2.0 OR LGPL-2.1-or-later
 */

#include <sdkconfig.h>

#ifdef CONFIG_AVM_ENABLE_NETWORK_PORT_DRIVER

#include <atom.h>
#include <context.h>
#include <debug.h>
#include <globalcontext.h>
#include <interop.h>
#include <mailbox.h>
#include <platform_defaultatoms.h>
#include <port.h>
#include <sdkconfig.h>
#include <term.h>
#include <utils.h>

// #define ENABLE_TRACE 1
#include <trace.h>

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wpedantic"
#include <esp32_sys.h>
#include <esp_efuse.h>
#include <esp_efuse_table.h>
#include <esp_log.h>
#include <esp_mac.h>
#include <esp_netif.h>
#include <esp_sntp.h>
#include <esp_wifi.h>
#include <lwip/inet.h>
#pragma GCC diagnostic pop

#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#define TCPIP_HOSTNAME_MAX_SIZE 255

// Reduce the maximum number of networks returned for devices with less ram to help mitigate OOM.
#if defined(CONFIG_IDF_TARGET_ESP32C2)
#define MAX_SCAN_RESULTS 10
#elif defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32C61) || defined(CONFIG_IDF_TARGET_ESP32C5)
#define MAX_SCAN_RESULTS 14
#elif defined(CONFIG_IDF_TARGET_ESP32P4) || defined(CONFIG_SPIRAM_USE_MALLOC)
#define MAX_SCAN_RESULTS 64
#else
#define MAX_SCAN_RESULTS 20
#endif
#define DEFAULT_SCAN_RESULT_MAX 6
#define IDF_DEFAULT_ACTIVE_SCAN_TIME 120
#define IDF_DEFAULT_PASSIVE_SCAN_TIME 360
#define SSID_MAX_SIZE 32
#define BSSID_SIZE 6

#define TAG "network_driver"
#define PORT_REPLY_SIZE (TUPLE_SIZE(2) + REF_SIZE)

static const char *const ap_atom = ATOM_STR("\x2", "ap");
static const char *const ap_channel_atom = ATOM_STR("\xA", "ap_channel");
static const char *const ap_sta_connected_atom = ATOM_STR("\x10", "ap_sta_connected");
static const char *const ap_sta_disconnected_atom = ATOM_STR("\x13", "ap_sta_disconnected");
static const char *const ap_sta_ip_assigned_atom = ATOM_STR("\x12", "ap_sta_ip_assigned");
static const char *const ap_started_atom = ATOM_STR("\xA", "ap_started");
static const char *const dhcp_hostname_atom = ATOM_STR("\xD", "dhcp_hostname");
static const char *const host_atom = ATOM_STR("\x4", "host");
static const char *const managed_atom = ATOM_STR("\x7", "managed");
static const char *const max_connections_atom = ATOM_STR("\xF", "max_connections");
static const char *const psk_atom = ATOM_STR("\x3", "psk");
static const char *const rssi_atom = ATOM_STR("\x4", "rssi");
static const char *const sntp_atom = ATOM_STR("\x4", "sntp");
static const char *const sntp_sync_atom = ATOM_STR("\x9", "sntp_sync");
static const char *const ssid_atom = ATOM_STR("\x4", "ssid");
static const char *const ssid_hidden_atom = ATOM_STR("\xB", "ssid_hidden");
static const char *const sta_atom = ATOM_STR("\x3", "sta");
static const char *const sta_connected_atom = ATOM_STR("\xD", "sta_connected");
static const char *const sta_beacon_timeout_atom = ATOM_STR("\x12", "sta_beacon_timeout");
static const char *const sta_disconnected_atom = ATOM_STR("\x10", "sta_disconnected");
static const char *const sta_got_ip_atom = ATOM_STR("\xA", "sta_got_ip");
static const char *const network_down_atom = ATOM_STR("\x0C", "network_down");

ESP_EVENT_DECLARE_BASE(sntp_event_base);
ESP_EVENT_DEFINE_BASE(sntp_event_base);

enum
{
    SNTP_EVENT_BASE_SYNC
};

enum network_cmd
{
    NetworkInvalidCmd = 0,
    NetworkStartCmd,
    NetworkRssiCmd,
    NetworkStopCmd,
    StaHaltCmd,
    StaConnectCmd,
    NetworkScanCmd
};

static const AtomStringIntPair cmd_table[] = {
    { ATOM_STR("\x5", "start"), NetworkStartCmd },
    { rssi_atom, NetworkRssiCmd },
    { ATOM_STR("\x4", "stop"), NetworkStopCmd },
    { ATOM_STR("\x8", "halt_sta"), StaHaltCmd },
    { ATOM_STR("\x7", "connect"), StaConnectCmd },
    { ATOM_STR("\x4", "scan"), NetworkScanCmd },
    SELECT_INT_DEFAULT(NetworkInvalidCmd)
};

struct ClientData
{
    GlobalContext *global;
    uint32_t port_process_id;
    uint32_t owner_process_id;
    uint64_t ref_ticks;
    bool managed;
};

struct ScanClientData
{
    uint64_t scan_ref_ticks;
    uint32_t owner_process_id;
    uint16_t num_results;
    GlobalContext *global;
};

static void scan_done_handler(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data);

static inline term make_atom(GlobalContext *global, AtomString atom_str)
{
    return globalcontext_make_atom(global, atom_str);
}

static inline term authmode_to_atom_term(GlobalContext *global, wifi_auth_mode_t mode)
{
    term authmode = term_invalid_term();
    switch (mode) {
        case WIFI_AUTH_OPEN:
            authmode = make_atom(global, ATOM_STR("\x4", "open"));
            break;
        case WIFI_AUTH_WEP:
            authmode = make_atom(global, ATOM_STR("\x3", "wep"));
            break;
        case WIFI_AUTH_WPA_PSK:
            authmode = make_atom(global, ATOM_STR("\x7", "wpa_psk"));
            break;
        case WIFI_AUTH_WPA2_PSK:
            authmode = make_atom(global, ATOM_STR("\x8", "wpa2_psk"));
            break;
        case WIFI_AUTH_WPA_WPA2_PSK:
            authmode = make_atom(global, ATOM_STR("\xC", "wpa_wpa2_psk"));
            break;
        case WIFI_AUTH_ENTERPRISE:
            authmode = make_atom(global, ATOM_STR("\x3", "eap"));
            break;
        case WIFI_AUTH_WPA3_PSK:
            authmode = make_atom(global, ATOM_STR("\x8", "wpa3_psk"));
            break;
        case WIFI_AUTH_WPA2_WPA3_PSK:
            authmode = make_atom(global, ATOM_STR("\xD", "wpa2_wpa3_psk"));
            break;
        case WIFI_AUTH_WAPI_PSK:
            authmode = make_atom(global, ATOM_STR("\x4", "wapi"));
            break;
        case WIFI_AUTH_WPA3_ENT_192:
            authmode = make_atom(global, ATOM_STR("\x13", "wpa3_enterprise_192"));
            break;
        case WIFI_AUTH_OWE:
            authmode = make_atom(global, ATOM_STR("\x3", "owe"));
            break;
#if (ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 4, 0))
        case WIFI_AUTH_DUMMY1:
            authmode = make_atom(global, ATOM_STR("\x6", "dummy1"));
            break;
        case WIFI_AUTH_DUMMY2:
            authmode = make_atom(global, ATOM_STR("\x6", "dummy2"));
            break;
#if (ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 3, 0))
        case WIFI_AUTH_DUMMY3:
            authmode = make_atom(global, ATOM_STR("\x6", "dummy3"));
            break;
#if (ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 2, 0))
        case WIFI_AUTH_DUMMY4:
            authmode = make_atom(global, ATOM_STR("\x6", "dummy4"));
            break;
        case WIFI_AUTH_DUMMY5:
            authmode = make_atom(global, ATOM_STR("\x6", "dummy5"));
            break;
#endif
#endif
#endif
#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0))
        case WIFI_AUTH_WPA3_EXT_PSK:
            authmode = make_atom(global, ATOM_STR("\xC", "wpa3_ext_psk"));
            break;
        case WIFI_AUTH_WPA3_EXT_PSK_MIXED_MODE:
            authmode = make_atom(global, ATOM_STR("\x12", "wpa3_ext_psk_mixed"));
            break;
#endif
#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0))
        case WIFI_AUTH_DPP:
            authmode = make_atom(global, ATOM_STR("\x3", "dpp"));
            break;
#endif
#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0))
        case WIFI_AUTH_WPA3_ENTERPRISE:
            authmode = make_atom(global, ATOM_STR("\xf", "wpa3_enterprise"));
            break;
        case WIFI_AUTH_WPA2_WPA3_ENTERPRISE:
            authmode = make_atom(global, ATOM_STR("\x14", "wpa2_wpa3_enterprise"));
            break;
#endif
        case WIFI_AUTH_WPA_ENTERPRISE:
            authmode = make_atom(global, ATOM_STR("\xe", "wpa_enterprise"));
            break;
        case WIFI_AUTH_MAX:
            authmode = ERROR_ATOM;
            break;
    }
    return authmode;
}

#define UNLIKELY_NOT_ESP_OK(E) UNLIKELY((E) != ESP_OK)

static term tuple_from_addr(Heap *heap, uint32_t addr)
{
    term terms[4];
    terms[0] = term_from_int((addr >> 24) & 0xFF);
    terms[1] = term_from_int((addr >> 16) & 0xFF);
    terms[2] = term_from_int((addr >> 8) & 0xFF);
    terms[3] = term_from_int(addr & 0xFF);

    return port_heap_create_tuple_n(heap, 4, terms);
}

static term wifi_ap_records_to_list_maybe_gc(GlobalContext *global, wifi_ap_record_t *ap_records, uint16_t num_results, void *heap)
{
    term networks_data_list = term_nil();
    term ssid_atom_term = make_atom(global, ssid_atom);
    term rssi_atom_term = make_atom(global, rssi_atom);
    term authmode_atom_term = make_atom(global, ATOM_STR("\x8", "authmode"));
    term bssid_atom_term = make_atom(global, ATOM_STR("\x5", "bssid"));
    term channel_atom_term = make_atom(global, ATOM_STR("\x7", "channel"));
    for (int i = num_results - 1; i >= 0; i--) {
        term ssid;
        size_t ssid_size = strlen((const char *) ap_records[i].ssid);
        if (ssid_size > 0) {
            ssid = term_from_literal_binary(ap_records[i].ssid, ssid_size, heap, global);
            ESP_LOGD(TAG, "Adding SSID: %s", ap_records[i].ssid);
        } else {
            const char *hidden_ap = "(hidden)";
            ssid = term_from_literal_binary((const uint8_t *) hidden_ap, (uint16_t) strlen(hidden_ap), heap, global);
            ESP_LOGD(TAG, "Adding SSID: %s", hidden_ap);
        }

        term rssi = term_from_int(ap_records[i].rssi);
        ESP_LOGD(TAG, "Adding RSSI: %i", ap_records[i].rssi);

        term authmode = authmode_to_atom_term(global, ap_records[i].authmode);
        ESP_LOGD(TAG, "Adding auth mode: %i", ap_records[i].authmode);

        term bssid = term_from_literal_binary((const void *) ap_records[i].bssid, sizeof(ap_records[i].bssid), heap, global);
        ESP_LOGD(TAG, "Adding BSSID: %02x:%02x:%02x:%02x:%02x:%02x", ap_records[i].bssid[0], ap_records[i].bssid[1], ap_records[i].bssid[2], ap_records[i].bssid[3], ap_records[i].bssid[4], ap_records[i].bssid[5]);

        term channel = term_from_int((int32_t) ap_records[i].primary);
        ESP_LOGD(TAG, "Adding Channel: %i", ap_records[i].primary);

        term ap_data = term_alloc_map(5, heap);
        term_set_map_assoc(ap_data, 0, ssid_atom_term, ssid);
        term_set_map_assoc(ap_data, 1, channel_atom_term, channel);
        term_set_map_assoc(ap_data, 2, bssid_atom_term, bssid);
        term_set_map_assoc(ap_data, 3, authmode_atom_term, authmode);
        term_set_map_assoc(ap_data, 4, rssi_atom_term, rssi);

