atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
        BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + TERM_BINARY_HEAP_SIZE(error_len), heap);
        term reason = term_from_string((const uint8_t *) error, (uint16_t) error_len, &heap);
        send_scan_error_from_task_heap(data->global, data->owner_process_id, reason, data->scan_ref_ticks, &heap);
        END_WITH_STACK_HEAP(heap, data->global);

        err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);
        if (UNLIKELY(err != ESP_OK)) {
            ESP_LOGE(TAG, "Failed to unregister event handler for reason %s, future scans may fail", esp_err_to_name(err));
        } else {
            free(data);
        }
        return;
    }

    uint16_t num_results = data->num_results;
    uint16_t return_results;
    if (discovered > num_results) {
        return_results = num_results;
    } else {
        return_results = discovered;
    }
    wifi_ap_record_t *ap_records = NULL;
    if (return_results > 0) {
        ap_records = (wifi_ap_record_t *) calloc((size_t) return_results, sizeof(wifi_ap_record_t));
        if (IS_NULL_PTR(ap_records)) {
            BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2), heap);
            send_scan_error_from_task_heap(data->global, data->owner_process_id, OUT_OF_MEMORY_ATOM, data->scan_ref_ticks, &heap);
            END_WITH_STACK_HEAP(heap, data->global);
            err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);
            if (UNLIKELY(err != ESP_OK)) {
                ESP_LOGE(TAG, "Failed to unregister event handler for reason %s, future scans may fail", esp_err_to_name(err));
            } else {
                // This cannot be free'd if unregister fails or the next scan_done event will try
                // to use the freed data.
                free(data);
            }
            return;
        }
        err = esp_wifi_scan_get_ap_records(&num_results, ap_records);
    } else {
        esp_wifi_clear_ap_list();
        err = ESP_OK;
    }

    if (UNLIKELY(err != ESP_OK)) {
        // the ap_list must be cleared on failures to prevent a memory leak
        esp_wifi_clear_ap_list();
        ESP_LOGE(TAG, "Failed to obtain scan results, reason: %s", esp_err_to_name(err));
        const char *error = esp_err_to_name(err);
        size_t error_len = strlen(error);

        BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + TERM_BINARY_HEAP_SIZE(error_len), heap);
        term reason = term_from_string((const uint8_t *) error, (uint16_t) error_len, &heap);
        send_scan_error_from_task_heap(data->global, data->owner_process_id, reason, data->scan_ref_ticks, &heap);
        END_WITH_STACK_HEAP(heap, data->global);
        free(ap_records);
        err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);
        if (UNLIKELY(err != ESP_OK)) {
            ESP_LOGE(TAG, "Failed to unregister event handler for reason %s, future scans may fail", esp_err_to_name(err));
        } else {
            free(data);
        }
        return;
    }
    ESP_LOGD(TAG, "Scan found %i networks", num_results);

    // ap_data example: {scan_results, {NumberResults, [#{ssid => SSID, rssi => DBM, authmode => Mode, bssid => Bssid, chanel => ChNumber}]}}
    size_t ap_data_size = TUPLE_SIZE(2) + term_map_size_in_terms(5) + TERM_BINARY_HEAP_SIZE(SSID_MAX_SIZE) + TERM_BINARY_HEAP_SIZE(BSSID_SIZE);
    size_t results_size = PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + LIST_SIZE(num_results, ap_data_size);
    ESP_LOGD(TAG, "Requesting size '%i' on heap for scan results", results_size);
    BEGIN_WITH_STACK_HEAP(results_size, heap);

    term networks_data_list = term_nil();
    if (num_results != 0) {
        networks_data_list = wifi_ap_records_to_list_maybe_gc(data->global, ap_records, num_results, &heap);
    }
    free(ap_records);
    term scan_results = port_heap_create_tuple2(&heap, term_from_int(discovered), networks_data_list);
    term scan_results_atom = make_atom(data->global, ATOM_STR("\xc", "scan_results"));
    term results_tuple = port_heap_create_tuple2(&heap, scan_results_atom, scan_results);
    term ref = term_from_ref_ticks(data->scan_ref_ticks, &heap);
    term msg = port_heap_create_tuple2(&heap, ref, results_tuple);

    port_send_message_from_task(data->global, term_from_local_process_id(data->owner_process_id), msg);
    END_WITH_STACK_HEAP(heap, data->global);

    // Send this event unregister error after the good scan results. This will be caught by the
    // catch-all handler and print a message to the console, if this is discovered to happen in the
    // wild, a future callback or other mechanism for programmatic notification may be needed, for
    // blocking scans this may need to have an alternative return that includes the unregister error,
    // along with the good results (since future scans may fail).
    err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "Failed to unregister event handler for reason %s, future scans may fail", esp_err_to_name(err));
        const char *error = esp_err_to_name(err);
        size_t error_len = strlen(error);
        BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + TERM_BINARY_HEAP_SIZE(error_len), heap);
        term reason = term_from_string((const uint8_t *) error, (uint16_t) error_len, &heap);
        send_scan_error_from_task_heap(data->global, data->owner_process_id, reason, data->scan_ref_ticks, &heap);
        END_WITH_STACK_HEAP(heap, data->global);
    } else {
        free(data);
    }
}

//
// Event Handlers
//

static void event_handler(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data)
{
    // TODO: Change all of the logging in event_handler to debug level, or move it to the
    // called send_* functions. We should not do any io operations inside the callback handler,
    // but debug output seems a fair trade off.
    struct ClientData *data = (struct ClientData *) arg;
    if (event_base == WIFI_EVENT) {

        switch (event_id) {

            case WIFI_EVENT_STA_START: {
                // TODO: expose an erlang callback so applications can choose how to respond to this
                // event, i.e. start a periodic scan for known networks, or initiate a connection
                ESP_LOGI(TAG, "WIFI_EVENT_STA_START received.");
                if (!data->managed) {
                    esp_wifi_connect();
                }
                break;
            }

